КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_ТранспортныеСредства/КонтурЛогистика_ТранспортныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_ТранспортныеСредства</name>
  <attributes>
    <name>VIN</name>
    <comment>необязательно, VIN номер</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АрендодательЛизингодатель</name>
    <comment>Собственник ТС</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВладения</name>
    <comment>вид владения ТС из перечисления</comment>
    <type>
      <types>EnumRef.КонтурЛогистика_ВидыВладенияТранспортнымСредством</types>
    </type>
  </attributes>
  <attributes>
    <name>ВместимостьКубМ</name>
    <comment>обязательно (за исключением тягача)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрузоподъемностьТонн</name>
    <comment>обязательно (за исключением тягача)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорАрендаЛизинг</name>
    <comment>обязателен если вид владения аренда/лизинг, указывается из справочника договоров</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркаТС</name>
    <comment>обязательно</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрицепПоУмолчанию</name>
    <comment>автоматически подставлять этот прицеп, когда в документе выбран этот автомобиль</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>РегНомер</name>
    <comment>обязательно</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СТС</name>
    <comment>необязательно, серия и номер СТС без учета пробелов и знака номера</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТС</name>
    <comment>обязательно</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПрицеп</name>
    <comment>признак для фильтрации при выборе</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнвНомер</name>
    <comment>Заполняется для троллейбусов и трамваев.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МодельТС</name>
    <comment>Модель транспортного средства согласно паспорту транспортного средства</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп2ПоУмолчанию</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПечатнойФормыПутыхЛистов</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыПечатныхФормПутыхЛистов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТСПоКлассификатору</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыТранспортныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнойТипТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяНесколькоВидовТоплива</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТопливоПоУмолчанию</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ГорючеСмазочныеМатериалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКузова</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СвязанныеОбъекты</name>
    <attributes>
      <name>СвязанныйОбъект</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ТранспортноеСредство</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначенияУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_ТранспортныеСредства/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(Наименование) Тогда 
		Наименование = "" + РегНомер + " " + ТипТС + " " + МаркаТС + " " + Формат(ГрузоподъемностьТонн,"ЧН=; ЧГ=") + " т"; 
	КонецЕсли;
	
	Если Не (ДополнительныеСвойства.Свойство("ОтключитьПроверки") И ДополнительныеСвойства.ОтключитьПроверки) Тогда 
	
		РезультатПроверки = Справочники.КонтурЛогистика_ТранспортныеСредства.РезультатПроверкиАрендатораДоговора(ЭтотОбъект, Отказ);
		Справочники.КонтурЛогистика_ТранспортныеСредства.ВывестиРезультатПроверкиПолей(РезультатПроверки);
	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипПечатнойФормыПутыхЛистов)
		И ЗначениеЗаполнено(ТипТС) Тогда
		
		ТипПечатнойФормыПутыхЛистов = Справочники.КонтурЛогистика_ТранспортныеСредства.ТипПечатнойФормыПоТипуТранспортногоСредства(ТипТС);
	КонецЕсли;
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ", ЭтотОбъект, Отказ);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("КонтурЛогистика_ТранспортныеСредства_ПередЗаписью_После", Истина, ПараметрыПМ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ОбъектУчетнойСистемыСсылка")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ОбъектУчетнойСистемыСсылка) Тогда 
		
		ОбъектУчетнойСистемыСсылка = ДанныеЗаполнения.ОбъектУчетнойСистемыСсылка;
		
		Наименование = Строка(ОбъектУчетнойСистемыСсылка);
		НоваяСвязь = СвязанныеОбъекты.Добавить();
		НоваяСвязь.СвязанныйОбъект = ОбъектУчетнойСистемыСсылка;
		
		Если КонтурЛогистика_КонвертацияСервер.ЭтоНетиповаяСсылкаДляСвязанногоОбъекта(Ссылка, ОбъектУчетнойСистемыСсылка) Тогда
			КонтурЛогистика_КонвертацияСервер.ЗаполнитьДанныеДляНетиповогоСправочникаВСвязанныхОбъектах(НоваяСвязь, ОбъектУчетнойСистемыСсылка)
		КонецЕсли;
		
		// TODO включить после реализации справочника конвертации справочников
		// Справочники.КонтурЛогистика_НастройкиКонвертацииСправочников.ЗаполнитьСущность(ЭтотОбъект, ОбъектУчетнойСистемыСсылка, Перечисления.КонтурЛогистика_СправочникиКонтурЛогистика);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
